Revit 2024 API
GroundConductorSizeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual GroundConductorSizeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As GroundConductorSizeSetIterator
Visual C++
public:
virtual GroundConductorSizeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
GroundConductorSizeSet Class
Autodesk.Revit.DB.Electrical Namespace